<!DOCTYPE html PUBLIC "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
  <meta http-equiv="Content-Type"
 content="text/html; charset=iso-8859-1">
  <meta name="GENERATOR"
 content="Mozilla/4.75 [en] (X11; U; Linux 2.2.14-SMP i686) [Netscape]">
  <title>bericht.htm</title>
</head>
<body style="background-color: rgb(255, 255, 255);">
<center><b><font size="+1">ABSCHLUSSBERICHT</font></b>
<p><b><font color="#008000"><font size="+2">1 Allgemeine Angaben</font></font></b></p>
</center>
<p><b><font size="+1">1.1 <font color="#ff0000">DFG-Gesch&auml;ftszeichen</font></font></b>
</p>
<ul>
PR 676/2-1, PR 676/2-2<br>
</ul>
<b><font size="+1">1.2 <font color="#ff0000">Antragsteller</font></font></b>
<ul>
Thomas Prellberg, PD Dr. rer. nat. habil., Dipl.-Phys., Dipl.-Math.
</ul>
<ul>
Privatdozent (ab 15. Sept. Apl.-Prof.), Technische Universit&auml;t
Clausthal<br>
und Reader in Applied Mathematics, Queen Mary, University of London<br>
  <p>23.11.1964, deutsch</p>
</ul>
<b><font size="+1">1.3 <font color="#ff0000">Institut/Lehrstuhl</font></font></b>
<ul>
  <span style="text-decoration: underline;">Technische Universit&auml;t
Clausthal:</span><br>
  <br>
Institut f&uuml;r Theoretische Physik <br>
Abteilung Statistische Physik und Nichtlineare Dynamik
  <p>Arnold-Sommerfeld-Stra&szlig;e 6, D-38678 Clausthal-Zellerfeld </p>
  <p>Tel.: 05323/72-3013 </p>
  <p>Fax.: 05323/72-3799 </p>
  <p><a href="mailto:thomas.prellberg@tu-clausthal.de">e-mail:
thomas.prellberg@tu-clausthal.de</a> </p>
</ul>
<ul>
  <span style="text-decoration: underline;">Queen Mary, University of
London:</span><br>
  <br>
School of Mathematical Sciences<br>
Dynamical Systems Group
  <p>Mile End Road, London E1 4NS, United Kingdom </p>
  <p>Tel.: +44 20 7882 5490 </p>
  <p>Fax.: 44 20 8981 9587 </p>
  <p><a href="mailto:t.prellberg@qmul.ac.uk">e-mail:
t.prellberg@qmul.ac.uk</a> </p>
  <p><span style="text-decoration: underline;">privat:</span> <br>
  </p>
  <p>22c
Broomhill Road, Woodford Green IG8 9HA, United Kingdom<br>
  </p>
</ul>
<b><font size="+1">1.4 <font color="#ff0000">Thema des Projekts</font></font></b>
<ul>
Relevanz der korrekten Modellierung von attraktiven und repulsiven
Wechselwirkungen in kollabierenden Polymeren: eine vergleichende
Untersuchung des Domb-Joyce Modells und verwandter Modelle.<br>
</ul>
<b><font size="+1">1.5 <font color="#ff0000">Berichtszeitraum</font></font></b>
<ul>
25.3.2002 - 25.8.2005<br>
</ul>
<b><font size="+1">1.6 <font color="#ff0000">Liste der Publikationen
aus
diesem Projekt</font></font></b>
<br>
<div style="margin-left: 40px;"><br>
[8] J. Krawczyk, T. Prellberg, A. L. Owczarek, and A.
Rechnitzer,
``On random walks with multiple site weightings and restrictions,''
in preparation<br>
[7] J. Krawczyk, A. L. Owczarek, T. Prellberg, and A.
Rechnitzer,
``Simulation of Lattice Polymers with Hydrogen-Like Bonding,''
in preparation<br>
[6] J. Krawczyk, A. L. Owczarek, T. Prellberg, and A.
Rechnitzer,
``Pulling absorbing and collapsing polymers off a surface,''
Journal of Statistical Mechanics: theory and experiment, JSTAT (2005)
P05008<br>
[5] J. Krawczyk, A. L. Owczarek, T. Prellberg, and A.
Rechnitzer,
``Layering transitions for adsorbing polymers in poor solvents,''
Europhys. Lett. <b>70</b> (2005) 726-732<br>
[4] J. Krawczyk, T. Prellberg, A. L. Owczarek, and A.
Rechnitzer,
``Stretching of a chain polymer adsorbed at a surface,''
Journal of Statistical Mechanics: theory and experiment, JSTAT (2004)
P10004<br>
[3] T. Prellberg, J. Krawczyk, and A. Rechnitzer,
``Polymer simulations with a flat histogram stochastic growth
algorithm,''
Computer Simulation Studies in Condensed Matter Physics XVII, Springer
Verlag, 2005, in print<br>
[2] T. Prellberg and J. Krawczyk, ``Flat histogram
version of the pruned and enriched Rosenbluth method,''
Phys. Rev. Lett. <b>92</b> (2004) 120602;
selected for Virt. J. Biol. Phys. Res. <b>7</b> (2004)<br>
[1] T. Prellberg and A. L. Owczarek, ``Polymer
Collapse in High Dimensions: Monte Carlo Simulation of Lattice
Models,''
in Computer Simulation Studies in Condensed Matter Physics XVI, pages
147-151,
Springer Verlag, 2004<br>
</div>
<ul>
</ul>
<center><b><font color="#008000"><font size="+2">2 Arbeits- und
Ergebnisbericht</font></font></b></center>
<p><b><font size="+1">2.1 <font color="#ff0000">Ausgangsfragen und
Zielsetzung
des Projekts</font></font></b>
</p>
<ul>
Die zu untersuchende Fragestellung dieses Projektes war, in wie weit
das erweiterte
Domb-Joyce Modell und verwandte Modelle sich in Bezug auf eine
Beschreibung
des Polymerkollaps von <span style="font-style: italic;">Interacting
Self-Avoiding Walks</span> (ISAW) unterscheiden. Es war zu erwarten,
da&szlig;
umfangreiche Monte-Carlo Simulationen implementiert, durchgef&uuml;hrt
und ausgewertet werden mu&szlig;ten.
</ul>
<p style="margin-left: 40px;">Es wurde weiter erhofft, da&szlig; die
Simulationsergebnisse wichtige R&uuml;ckschl&uuml;sse
auf die korrekte Modellbildung f&uuml;r Polymere zulassen und
Indikationen
f&uuml;r bessere theoretische Analysen geben.
</p>
<p style="margin-left: 40px;">Als Nebenresultat wurde eine
Weiterentwicklung vorhandener Monte-Carlo
Methoden f&uuml;r Polymersimulation erwartet.</p>
<b><font size="+1">2.2 <font color="#ff0000">Entwicklung der
durchgef&uuml;hrten
Arbeiten einschlie&szlig;lich Abweichungen vom urspr&uuml;nglich
gef&uuml;hrten
Konzept, ggf. wissenschaftliche Fehlschl&auml;ge, Probleme in der
Projektorganisation
oder technischen Durchf&uuml;hrung</font></font></b>
<blockquote>Wie bereits in der nachgereichten Antragserg&auml;nzung
erw&auml;hnt, wurde in Gespr&auml;chen mit Experten
f&uuml;r Monte Carlo Simulationen meine beabsichtigte Auswahl eines
Algorithmus
konkretisiert. Im Hinblick auf die zu erwartende Untersuchung von
Systemen
mit bimodaler Energieverteilung, bei denen der bisher angewandte
Algorithmus
PERM (<span style="font-style: italic;">Pruned and Enriched Rosenbluth
Method</span>) [Grassberger1997] an seine Grenzen kam, bestand die
Anfangsphase des
Projektes darin, einen Hybridalgorithmus aus
PERM und Multikanonischer Methode (MUCA) [Berg1992] zu
entwickeln. Solch ein Hybridalgorithmus ist eine nicht-triviale
Weiterentwicklung
und geht im Interesse weit &uuml;ber die hier beabsichtigte Anwendung
hinaus. <br>
  <br>
Zur Einarbeitung meines Mitarbeiters wurde eine Neuimplementation von
PERM erstellt und auf ein Polymerkollapsmodell angewandt, in welchem
eine bimodale Verteilung zu erwarten war [Foster2001]. Diese
Neuimplementation wurde dann als Grundstein der sich
anschlie&szlig;enden Neuentwicklung. <br>
  <br>
W&auml;hrend eines Monte-Carlo Workshop, den ich 2003 besuchte [1],
stellte sich heraus, da&szlig; eine konkurrierende Arbeitsgruppe
&auml;hnliche Ans&auml;tze verfolgte [Bachmann2003]. W&auml;hrend in
dieser Arbeit MUCA auf PERM aufzusetzen, waren wir aufgrund unserer
bisherigen Erfahrung mit PERM in der Lage, das durch MUCA erreichte
gleichf&ouml;rmige Sampling des Histogramms direkt im Rahmen der PERM
zugrundeliegenden Methodik zu implementieren. Da dies zu einem
"flachen" Histogramm f&uuml;hrt, nennen wir diesen Algorithmus FlatPERM
[2]. Die Stellungnahme des
Referees des bei PRL eingereichten Papers spricht f&uuml;r sich: "The
paper presents an interesting extension of the Grassberg-Rosenbluth
method (PERM), which appears to me superior to the recently published
extension of PERM by Bachmann and Janke."<br>
  <br>
Die an diese Arbeit anschlie&szlig;ende Simulation von
Domb-Joyce-artigen Modellen erwies sich schwieriger als erwartet.
Obwohl wir im Herbst 2003 schon &uuml;ber erste Ergebnisse auf einem
Monte-Carlo Workshop in Melbourne berichten konnten, z&ouml;gerten wir
aufgrund unklarer Interpretation der Simulation mit einer
Ver&ouml;ffentlichung. (Erst jetzt haben wir Simulationen in
ausreichendem Ma&szlig;e durchgef&uuml;hrt, um unsere Daten
zuversichtlich interpretieren zu k&ouml;nnen. Die Datenanalyse wurde
vor einem Monat w&auml;hrend eines Aufenthaltes in Melbourne
durchgef&uuml;hrt, und der Preprint ist kurz vor Fertigstellung [8]).<br>
  <br>
Andererseits hatten wir mit FlatPERM einen neuartigen Algorithmus in
der Hand,
welcher f&uuml;r viele Problemstellungen im Bereich des Polymerkollaps
und der Proteinfaltung die beste, wenn nicht sogar die
einzige effiziente Simulationsmethode darstellte. Wir&nbsp; begannen
daher eine Serie von Simulationen, um die St&auml;rke dieses
Algorithmus aufzuzeigen. FlatPERM f&uuml;hrte zu erfolgreichen
Simulationen von Polymerkollaps in zwei und drei Raumdimensionen [2]
und von Proteinfaltungsmodellen [3].<br>
  <br>
In den bisher erw&auml;hnten Simulationen war das Ziel ein
gleichf&ouml;rmiges Sampling des Energieraumes. Ebenso kann man auch
eine andere Parametrisierung des Konfigurationsraumes w&auml;hlen, wie
zum Beispiel Koordinaten des Endpunktes eines Polymers. In dieser Weise
konnten wir Polymere in einem Streifen simulieren [3] ohne weitere
Hilfsmittel wie zum Beispiel Markovian Anticipation [Hsu2003]
heranziehen zu m&uuml;ssen.<br>
  <br>
Die wahre St&auml;rke von FlatPERM zeigte sich jedoch bei Simulationen,
in denen eine mehrdimensionale Parametrisierung vorgenommen wurde. So
konnten wir das Abziehen eines an einer Oberfl&auml;chen adsorbierten
Polymers simulieren [4] und das Wechselspiel zwischen Adsorption und
Kollaps untersuchen [5]. Diese Simulationen erforderten eine
zweidimensionale Histogrammparametrisierung.<br>
  <br>
Eine logische Fortsetzung war nun eine Simulation des Abziehens von
adsorbierten und kollabierten Polymeren [6]. Diese erforderte eine
dreidimensionale Parametrisierung, und stellt aufgrund der
Gr&ouml;&szlig;e des ben&ouml;tigten Histogramms die derzeitige Grenze
einer sinnvollen Anwendung von mehrdimensionalem FlatPERM dar. <br>
  <br>
Die bisher beschriebenen Simulationen konnten komfortabel auf einzelnen
leistungsstarken PCs durchgef&uuml;hrt werden. Die urspr&uuml;nglich
beabsichtigten umfangreichen Simulationen von erweiterten
Domb-Joyce-Modellen ben&ouml;tigten jedoch eine andere
Gr&ouml;&szlig;enordnung der Simulation. Um zu aufschlu&szlig;reichen
Ergebnissen zu gelangen, mu&szlig;ten hinreichend gro&szlig;e Systeme
simuliert werden, welches wiederum zu einer Histogrammgr&ouml;&szlig;e
f&uuml;hrte, die unrealistisch war. Nachdem wir verschiedene
Parallelisierungsmethoden diskutierten und verwarfen, begannen wir
Simulationen mit einer Hybridversion von FlatPERM, in welcher nur
gewisse Parameter gleichf&ouml;rmig gesampled werden, und andere
Parameter in einem thermalen statistischen Ensemble gemittelt werden.
Dies f&uuml;hrt zu einer Verringerung des ben&ouml;tigten
Speicherplatzes, allerdings m&uuml;ssen nun mehrfache Simulationen
f&uuml;r verschiedene Werte des Temperaturparameters durchgef&uuml;hrt
werden. Diese Simulationen wurden auf einem gro&szlig;en
Computercluster (64 Prozessoren)&nbsp; in Australien durchgef&uuml;hrt.
Ein Preprint ist derzeit in Vorbereitung [8].<br>
  <br>
Simulationen des Pilotprojektes [Foster2001] mittels FlatPERM sind
ebenfalls abgeschlossen und ein Preprint in Vorbereitung [7].<br>
  <br>
Abschlie&szlig;end sei zu erw&auml;hnen, da&szlig; die Arbeiten [2-6]
auf eine gro&szlig;e Resonanz stie&szlig;en. Ich habe in der Folgezeit
hier&uuml;ber mehr als 15 Vortr&auml;ge gehalten, wobei 6 dieser
Vortr&auml;ge eingeladene Vortr&auml;ge auf internationalen Konferenzen
und Workshops waren. Es ist nicht zu viel gesagt, da&szlig; mich diese
Arbeiten in der Monte-Carlo Community etabliert haben. Seit Herbst 2004
wurde ich in diesem Zusammenhang auch zum Associate Investigator am
Centre for Excellence "Mathematics and Statistics of Complex Systems"
an der University of Melbourne ernannt, wo die zuvor erw&auml;hnten
umfangreichen Simulationen durchgef&uuml;hrt worden sind.<br>
  <br>
[Bachmann2003] <span class="fieldLabel">M. Bachmann and W. Janke, </span>Multicanonical
chain-growth algorithm, Phys. Rev. Lett. 91 (2003) 208105<br>
  <br>
[Berg1992] B.A. Berg and T. Neuhaus, Multicanonical ensemble - a new
approach to simulate 1st-order phase-transitions, Phys. Rev. Lett. 68
(1992) 9-12<br>
  <br>
[Foster 2001] D.P. Foster and F. Seno, Two-dimensional self-avoiding
walk with hydrogen-like bonding: phase diagram and critical behaviour,
J. Phys. A 34 (2001) 9939-9957<br>
  <br>
[Grassberger1997] P. Grassberger, Pruned-enriched Rosenbluth method:
Simulations of theta polymers of chain length up to 1,000,000, Phys.
Rev. E 56 (1997) 3682-3693<br>
  <br>
&nbsp;[Hsu2003] H.P. Hsu and P. Grassberger, 2-Dimensional polymers
confined in a strip, Eur. Phys. J. B 36 (2003) 209-214 <br>
  <br>
</blockquote>
<b><font size="+1">2.3 <font color="#ff0000">Darstellung der
erreichten Ergebnisse
und Diskussion im Hinblick auf den relevanten Forschungsstand,
m&ouml;gliche
Anwendungsperspektiven und denkbare Folgeuntersuchungen</font></font></b>
<ul>
Im Rahmen des Projektes wurde ein neuer Algorithmus, FlatPERM
entworfen, implementiert, und erfolgreich auf verschiedene
Polymermodelle angewandt [2-8]. Aufbauend auf PERM wurde ein
Algorithmus geschaffen, welcher im Sinne von flachen
Histogramm-Methoden den Konfigurationsraum bez&uuml;glich geeigneter
Parametrisierungen gleichm&auml;&szlig;ig sampled. Somit ist der
gesamte Konfigurationsraum mit Hilfe einer einzigen Simulation
zug&auml;nglich gemacht.<br>
  <br>
Um die St&auml;rke des Algorithmus aufzuzeigen, simulierten wir das
Wechselspiel von Oberfl&auml;chenadsorption, Kollaps, und Strecken
eines Polymers unter Einflu&szlig; einer &auml;u&szlig;eren Kraft (z.B.
Optical Tweezers). Mittels FlatPERM wurde erstmals das Wechselspiel von
Adsorption und Kollaps bei sehr geringen Temperaturen mittels
Monte-Carlo Simulationen untersucht [4-6]. Unter anderem fanden wir bei
unseren Simulationen ein bisher nicht beobachtetes Ph&auml;nomen von
Lagenausbildung bei Adsorption von kollabierten Polymeren [5]. Wir
fanden Mehrlagenkonfigurationen, welche f&uuml;r endliche
Systemgr&ouml;&szlig;en thermodynamisch stabil waren. Diese Phasen
verschwinden im thermodynamischen Limes unendlicher Kettenl&auml;nge,
k&ouml;nnten aber bei endlichen&nbsp; Kettenl&auml;ngen in einem
Experiment beobachtbar sein. Unser beschriebenes Szenario liefert eine
Alternative zum Verst&auml;ndnis des in der Literatur diskutierten
Ph&auml;nomens eines "surface-attached Globule".<br>
  <br>
Das eigentliche Ziel dieses Forschungsprojektes war ein vertieftes
Verst&auml;ndnis von Polymerkollaps durch Simulationen eines
erweiterten Domb-Joyce Modelles. Hierzu simulierten wir Zufallswege auf
regul&auml;ren Gittern, welche durch die Anzahl von mehrfach besuchten
Gitterpl&auml;tzen gewichtet wurden. Selbst bei einer
Einschr&auml;nkung auf Ensembles mit ein- bis dreifach besuchten
Gitterpl&auml;tzen erwies sich diese Simulation als &auml;u&szlig;erst
schwierig, und die Auswertung der Simulationsdaten als sehr
anspruchsvoll. Zun&auml;chst schien sich die intuitive Vorhersage zu
best&auml;tigen, da&szlig; es bei einer hinreichend starken Gewichtung
von zwei- bzw. dreifach besuchten Gitterpl&auml;tzen zu einem
Kollaps&uuml;bergang kommt. Eine genauere Untersuchung in Verbindung
mit Finite-size Scaling lieferte jedoch den Verdacht, da&szlig; es sich
um keinen echten Phasen&uuml;bergang, sondern ein einfaches Crossover
handeln k&ouml;nnte. <br>
  <br>
Um diesen Unterschied eindeutig zu sehen, waren Simulationen von
Systemgr&ouml;&szlig;en n&ouml;tig, welche einen Zugang zu einem
hinreichend leistungsstarten Computercluster erforderlich machten.
Simulationsergebnisse von vier verschiedenen Modellen lieferten
letztendlich eindeutige Ergebnisse, welche allerdings mehr Fragen
aufworfen als beantworteten. <br>
  <br>
Wir simulierten Zufallswege auf dem Quadratgitter und dem einfachen
kubischen Gitter. Zus&auml;tzlich simulierten wir eine Variante von
Zufallswegen, bei welchen eine direkte Umkehr verboten war. In dieser
Weise erhielten wir vier Modelle, welche &uuml;berraschenderweise
unterschiedliche Phasendiagramme besitzen.<br>
  <br>
Die Ergebnisse im Einzelnen sind wie folgt:<br>
  <br>
  <ul>
    <li>Zufallswege auf dem einfachen kubischen Gitter, direkte Umkehr
verboten:</li>
  </ul>
</ul>
<div style="margin-left: 80px;">Hier findet man die erwarteten
Kollapsphasen&uuml;berg&auml;nge. Der &Uuml;bergang zu einer
Phase&nbsp; mit zweifach besetzten Gitterpl&auml;tzen ist zweiter
Ordnung, der &Uuml;bergang zu einer Phase mit dreifach besetzten
Gitterpl&auml;tzen ist erster Ordnung.<br>
</div>
<ul>
  <ul>
    <li>Zufallswege auf dem einfachen kubischen Gitter, direkte Umkehr
erlaubt:</li>
  </ul>
</ul>
<div style="margin-left: 80px;">Hier findet man nur einen der
erwarteten
Kollapsphasen&uuml;berg&auml;nge. Der &Uuml;bergang zu der Region, in
welcher zweifach
besetzte Gitterpl&auml;tze dominieren, ist ein Crossover, der
&Uuml;bergang zu einer
Phase mit dreifach besetzten Gitterpl&auml;tzen ist zweiter Ordnung.<br>
</div>
<ul>
  <ul>
    <li>Zufallswege auf dem Quadratgitter, direkte Umkehr verboten:</li>
  </ul>
</ul>
<div style="margin-left: 80px;">Hier findet man ebenfalls nur einen der
erwarteten
Kollapsphasen&uuml;berg&auml;nge. Der &Uuml;bergang zu der Region, in
welcher zweifach
besetzte Gitterpl&auml;tze dominieren, ist ein Crossover, der
&Uuml;bergang zu einer
Phase mit dreifach besetzten Gitterpl&auml;tzen ist zweiter Ordnung.
</div>
<ul>
  <ul>
    <li>Zufallswege auf dem Quadratgitter, direkte Umkehr erlaubt:</li>
  </ul>
</ul>
<div style="margin-left: 80px;">Hier findet man keinen
Kollapsphasen&uuml;bergang. Der &Uuml;bergang zu der Region, in welcher
zweifach
besetzte Gitterpl&auml;tze dominieren, ist ein Crossover, der
&Uuml;bergang zu der Region, in welcher dreifach besetzte
Gitterpl&auml;tzen dominieren, ebenfalls.
</div>
<br>
<div style="margin-left: 40px;">Es ist unklar, warum der
Kollaps&uuml;bergang derart empfindlich von solch geringf&uuml;gigen
Details wie einer direkten Umkehr abh&auml;ngen sollte. Insbesondere
ist unverst&auml;ndlich, warum es in einem der vier untersuchten
F&auml;lle &uuml;berhaupt keinen Kollaps gibt. Wir haben derzeit keine
theoretische Erkl&auml;rung f&uuml;r die beobachteten Ph&auml;nomene!<br>
<br>
Wir f&uuml;hlen uns best&auml;tigt in der im Antrag formulierten
Aussage, da&szlig; Gittermodelle f&uuml;r Polymerkollaps keineswegs
hinreichend verstanden sind. Simulationen von verwandten Modellen sind
unabdingbar, um bei einer Auswertung existierender Theorien und einer
Weiterentwicklung von neuen theoretischen Ans&auml;tzen zu
Polymerkollaps helfend zur Seite zu stehen.<br>
</div>
<ul>
Im Rahmen einer Diskussion &uuml;ber zuk&uuml;nftige FlatPERM-Projekte
kamen problemlos ein Dutzend Modelle zur Sprache, welche alle mittels
FlatPERM erfolgreich simuliert werden k&ouml;nnten. Da dem Algorithmus
ein Wachstumsprozess zugrunde liegt, ist FlatPERM potenziell f&uuml;r
alle Modelle, in denen Konfigurationen wohldefiniert (d.h. eindeutig
bzw. mit einer kontrollierten Vielfachheit) gewachsen werden
k&ouml;nnen, geeignet. W&auml;hrend wir uns hier auf Simulation von
Polymermodellen beschr&auml;nkten, sind auch bereits Anwendungen in
v&ouml;llig neuartigen und physikfremden Bereichen in Vorbereitung,
haupts&auml;chlich im Rahmen von approximativer Enumeration von
kombinatorischen Objekten, wie z.B. der Frage der Anzahl von
mustervermeidenden Permutationen. Von gr&ouml;&szlig;erer Relevanz
f&uuml;r physikalische Anwendungen ist eine Weiterentwicklung dieses
Algorithmus f&uuml;r Off-Lattice Simulationen, sowie die Entwicklung
einer Version dieses Algorithmus, welche eine sinnvolle
Parallelisierung erm&ouml;glicht. F&uuml;r beides gibt es bereits
erfolgversprechende Ans&auml;tze.<br>
</ul>
<b><font size="+1">2.4 <font color="#ff0000">Stellungnahme,&nbsp; ob
Ergebnisse
oder Vorhaben wirtschaftlich verwertbar sind und ob eine solche
Verwertung
erfolgt oder zu erwarten ist. Ggf. Angaben zu Patenten,
Industriekooperationen,
o.&auml;.</font></font></b>
<ul>
nicht relevant
</ul>
<b><font size="+1">2.5 <font color="#ff0000">Wer hat zu den
Ergebnissen des
Projekts beigetragen</font></font></b>
<ul>
PD Dr. Thomas Prellberg, Technische Universit&auml;t Clausthal
</ul>
<ul>
Dr. Jaroslaw Krawczyk, Technische Universit&auml;t Clausthal<br>
  <br>
Assoc. Prof. Aleksander L. Owczarek, University of Melbourne, Australien<br>
  <br>
Dr. Andrew Rechnitzer, University of Melbourne, Australien<br>
</ul>
<b><font size="+1">2.6 <font color="#ff0000">Qualifikationen des
wissenschaftlichen
Nachwuchses im Zusammenhang mit dem Projekt</font></font></b>
<ul>
Mein Mitarbeiter Dr. Jaroslaw Krawczyk hat aufgrund seiner Arbeit an
diesem Projekt eine Stelle am Centre for Excellence "Mathematics and
Statistics of Complex Systems" an der University of Melbourne erhalten.<br>
</ul>
<center><b><font color="#008000"><font size="+2">3 Zusammenfassung</font></font></b></center>
<p><b><font size="+1">3.1 <font color="#ff0000">Allgemeinverst&auml;ndliche
Darstellung der wichtigsten wissenschaftlichen Fortschritte und ggf.
ihrer
Anwendungsaspekte</font></font></b>
</p>
<ul>
Das zentrale Ergebnis dieses Forschungsprojektes ist die Entwicklung
eines neuartigen Algorithmus, der eine Verbindung von einem kinetischen
Wachstumsprozess mit gleichf&ouml;rmigem Sampling verbindet. Solch ein
Algorithmus erm&ouml;glicht die Untersuchung des gesamten relevanten
Parameterbereiches (z.B. Temperatur) in einem einzigen Simulationslauf.
Dieser Algorithmus hat ein Anwendungspotenzial, welches weit &uuml;ber
den Inhalt dieses Forschungsprojektes hinausgeht. <br>
  <br>
In einer Reihe von Arbeiten wurden die St&auml;rken dieses Algorithmus
aufgezeigt. Verschiedene Szenarien, wie zum Beispiel das Wechselspiel
zwischen Polymerkollaps und Oberfl&auml;chenadsorption wurden mittels
dieses Algorithmus zug&auml;nglich f&uuml;r Simulationen.
</ul>
<ul>
Die Untersuchung von erweiterten Domb-Joyce Modellen zum besseren
Verst&auml;ndnis von Polymerkollaps zeigte ein weitaus komplizierteres
Verhalten als erwartet. Unsere Erwartung, da&szlig; Gittermodelle
f&uuml;r Polymerkollaps keineswegs hinreichend verstanden sind, hat
sich best&auml;tigt.<br>
</ul>
<ul>
</ul>
<b><font size="+1">3.2 <font color="#ff0000">"&Uuml;berraschungen"
im Projektverlauf
und bei den Ergebnissen</font></font></b>
<ul>
Es war nicht vorhergesehen, da&szlig; es zu einer erfolgreichen
Neuentwicklung eines Algorithmus kommen w&uuml;rde, und da&szlig;
dieser Algorithmus ein derartiges Anwendungspotenzial besitzen
w&uuml;rde. Hierdurch wurde der Projektverlauf naturgem&auml;&szlig;
beeinflu&szlig;t. <br>
  <br>
Die Untersuchung des erweiterten Domb-Joyce Modells lieferte
Ergebnisse, welche nicht im Rahmen der Erwartungen lagen. Insbesondere
die Ergebnisse einer Modellvariante, in welcher keinerlei
Kollapsphasen&uuml;bergang auftrat, wirft eine Reihe von Fragen auf.<br>
</ul>
<b><font size="+1">3.3 <font color="#ff0000">Hinweise auf
m&ouml;gliche Erfolgsberichte
in den Publikumsmedien</font></font></b>
<blockquote>nicht relevant</blockquote>
</body>
</html>
