<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.77 [en] (X11; U; Linux 2.4.4-64GB-SMP i686) [Netscape]">
</head>
<body bgcolor="#FFFFFF">

<center><b><font size=+1>ANTRAG AUF GEW&Auml;HRUNG EINER SACHBEIHILFE (NEUANTRAG)</font></b>
<br>&nbsp;
<p><b><font color="#008000"><font size=+2>1 Allgemeine Angaben</font></font></b></center>

<p><b><font size=+1>1.1 <font color="#FF0000">Antragsteller</font></font></b>
<blockquote>Thomas Prellberg, Dr. rer. nat., Dipl.-Phys., Dipl.-Math.
<p>Wissenschaftlicher Assistent
<p>23.11.1964, deutsch
<p>Technische Universit&auml;t Clausthal
<p>Institut f&uuml;r Theoretische Physik, Abteilung Statistische Physik
und Nichtlineare Dynamik
<p>Arnold-Sommerfeld-Stra&szlig;e 6, D-38678 Clausthal-Zellerfeld
<p>Tel.: 05323/72-2085
<p>Fax.: 05323/72-3799
<p><a href="mailto:thomas.prellberg@tu-clausthal.de">e-mail: thomas.prellberg@tu-clausthal.de</a>
<p>privat: Vititorwall 27, D-38640 Goslar, Tel: 05321/709495</blockquote>
<b><font size=+1>1.2 <font color="#FF0000">Thema</font></font></b>
<ul>Relevanz der korrekten Modellierung von attraktiven und repulsiven
Wechselwirkungen in kollabierenden Polymeren: eine vergleichende Untersuchung
des erweiterten Domb-Joyce Modells und verwandter Modelle.</ul>
<b><font size=+1>1.3 <font color="#FF0000">Kennwort</font></font></b>
<blockquote>Erweitertes Domb-Joyce Modell</blockquote>
<b><font size=+1>1.4 <font color="#FF0000">Fachgebiet und Arbeitsrichtung</font></font></b>
<ul>Theoretische Physik, Statistische Mechanik</ul>
<b><font size=+1>1.5 <font color="#FF0000">Voraussichtliche Gesamtdauer</font></font></b>
<ul>3 Jahre</ul>
<b><font size=+1>1.6 <font color="#FF0000">Antragszeitraum</font></font></b>
<ul>M&auml;rz 2002 - M&auml;rz 2005</ul>
<b><font size=+1>1.7 <font color="#FF0000">Gew&uuml;nschter Beginn der
F&ouml;rderung</font></font></b>
<ul>M&auml;rz 2002</ul>
<b><font size=+1>1.8 <font color="#FF0000">Zusammenfassung</font></font></b>
<ul><i>``No modern theory of polymer excluded volume adequately describes
the crossover from poor to good solvent conditions.''&nbsp;</i> [BC1994]
<p>Leider zeigt diese Meinung zweier Pioniere auf dem Gebiet der Polymerphysik,
da&szlig; trotz&nbsp; Jahrzehnten intensiver Forschung immer noch zentrale
Fragen bez&uuml;glich des Polymerkollaps unbeantwortet sind, und dies trotz
wichtiger Fortschritte, wie der etablierten Korrespondenz des Theta-Punktes
zu einer trikritischen O(n)-Feldtheorie. Der Grund liegt in einem mangelhaften
Verst&auml;ndnis des Anwendbarkeitsbereichs verschiedener Modelle.&nbsp;
In j&uuml;ngster Zeit haben Simulationen von <i>Interacting Self-Avoiding
Walks </i>und verwandten Modellen aufgezeigt, da&szlig; im Gegensatz zu
allgemeinen Universalit&auml;tsargumenten die Einzelheiten der Modellierung
relevant f&uuml;r das kritische Verhalten des Polymerkollaps ist. In letzter
Zeit haben neue Algorithmen und eine drastisch erh&ouml;hte Leistungsf&auml;higkeit
von Computern die M&ouml;glichkeit er&ouml;ffnet, diese kontroversen Fragen
mit Hilfe von Simulationen zu attackieren. In diesem Sinne soll eine vergleichende
Untersuchung des <i>erweiterten Domb-Joyce Modells</i> und verwandter Modelle
durchgef&uuml;hrt werden.
<br>&nbsp;
<br>&nbsp;</ul>

<center><b><font color="#008000"><font size=+2>2 Stand der Forschung, eigene
Vorarbeiten</font></font></b></center>

<p><b><font size=+1>2.1 <font color="#FF0000">Stand der Forschung</font></font></b>
<blockquote>&nbsp;
<br>In einem Reviewpapier &uuml;ber das theoretische Verst&auml;ndnis von
langen Kettenmolek&uuml;len in verd&uuml;nnter L&ouml;sung stellten zwei
der Pioniere in diesem&nbsp; Gebiet fest, da&szlig; keine der modernen
Theorien den Kollaps&uuml;bergang von Polymeren in einem L&ouml;sungsmittel
ad&auml;quat beschreibt [BC1994]. Auf der anderen Seite gibt es Forscher,
die behaupten da&szlig; das Problem zum einen des "Excluded Volume" und
zum anderen des Polymerkollaps mehr oder weniger mit dem 3-Parameter-Edwards-Modell
[D1986,D1987] und der Korrespondenz zu einer trikritischen O(n)-Feldtheorie
[G1975,G1978,S1975] gel&ouml;st worden sind. Warum ist also das 3-Parameter-Edwards
Modell nach mehreren Jahrzehnten immer noch kontrovers? Nat&uuml;rlich
ist die Analyse dieses Modells sehr schwierig, aber wichtiger ist meines
Erachtens, da&szlig; der Bereich der Anwendbarkeit nicht v&ouml;llig verstanden
ist.
<p>Ein konzeptionell einfaches Gittermodell, das Modell der <i>Interacting
Self-Avoiding Walks</i> (ISAW) auf regul&auml;ren Gittern, bietet eine
alternative Beschreibung. Jedoch hat sich das ISAW-Modell als noch schwieriger
erwiesen, und man erh&auml;lt nur Teilantworten mit Hilfe von numerischen
Simulationen. In zwei Dimensionen ist das kritische Verhalten von ISAW
mit Hilfe von konformer Invarianz inzwischen weitgehend verstanden, aber
in vier Dimensionen zeigten unsere Simulationen k&uuml;rzlich ein&nbsp;
a&uuml;&szlig;erst &uuml;berraschendes Szenario, in dem starke Korrekturterme
einen thermodynamischen Phasen&uuml;bergang zweiter Ordnung als Phasen&uuml;bergang
erster Ordnung maskieren, so da&szlig; man eine v&ouml;llig neuartiges
Skalenverhalten findet [OP2000].
<p>Der physikalisch am relevanteste Fall von drei Raumdimensionen ist wegen
auftretender logarithmischer Korrekturen notorisch schwer zu analysieren
[HS1999]. Hinzu kommt, da&szlig; es andere Realisierungen von Polymeren
als Gittermodelle gibt, die ein unterschiedliches Kollapsverhalten zeigen,
obwohl sie die gleiche geschwollene Polymerphase besitzen, sowohl in zwei
[OP1995, PO1995] als auch drei Dimensionen [OP1995, PO1995, G1996].
<p>Die grundlegenden erlaubten Konfigurationen in Gittermodellen von Polymeren
sind <i>Zufallswege. </i>In Kontinuumsmodellen wie dem kontinuierlichen
Edwards Modell entspricht dies einer diffusiven Brownschen Bewegung.&nbsp;
Zufallswege k&ouml;nnen sich selbst &uuml;berschneiden und besitzen kein
``Excluded Volume''.&nbsp; Realistische Modelle f&uuml;r Polymere m&uuml;ssen&nbsp;
zus&auml;tzlich einen ``Excluded Volume''-Effekt besitzen, der eine Selbst&uuml;berlappung
der Polymerkette verbietet.&nbsp; Daher mu&szlig; eine absto&szlig;ende
Wechselwirkung zu dem Modell hinzugef&uuml;gt werden, um reale Polymere
zu modellieren. In der Modellierung der universalen Eigenschaften von Polymeren
mit Hilfe eines selbst-absto&szlig;enden Zufallsweges ist es gemeinhin
akzeptiert, da&szlig; man selbst bei einer schwachen Absto&szlig;ung schon
die kritischen Eigenschaften des SAW findet [V1998].
<p>Ein Modell, in dem man analytisch einige Fortschritte machen kann, ist
das
<i>Domb-Joyce Modell </i>[DJ1972]. Dies ist ein Zufallsweg auf dem
Gitter, in dem die Selbst&uuml;berschneidung durch einen absto&szlig;enden
Term, der abh&auml;ngig von der lokalen Dichte ist, gewichtet ist. Im August
2001 wurde in einer Reihe von Preprints sogar ein Beweis des L&auml;ngenskalenexponenten
f&uuml;r SAW in allen Dimensionen angek&uuml;ndigt, der im Rahmen des Domb-Joyce
Modells durchgef&uuml;hrt wurde [H2001, H2001a].
<p>Um nun jedoch einen Kollaps&uuml;bergang zu modellieren, mu&szlig; man
gleichzeitig eine zus&auml;tzliche attraktive Wechselwirkung hinzuf&uuml;gen.
Man hat somit ein kompliziertes Wechselspiel von ``geometrischer'' Selbstvermeidung
und ``thermaler'' attraktiver Wechselwirkung, und es ist schwer, diese
genau voneinander zu separieren. In der Literatur findet man eine Reihe
von verschiedenen Modellen, die auf dieser Philosophie aufbauen. Beginnt
man mit strenger Selbstvermeidung und f&uuml;gt dann eine attraktive Wechselwirkung
hinzu, erh&auml;lt man zum Beispiel das kanonische ISAW Modell, oder, bei
einer andersgearteten Selbstvermeidung, sogenannte <i>Interacting Self-Avoiding
Trails</i> (ISAT) [SO1984, CGLS1988]. Es zeigt sich, da&szlig; ISAT&nbsp;
in zwei und drei Dimensionen anderes kritisches Verhalten als ISAW besitzt
[OP1995, PO1995, G1996], w&auml;hrend in vier Dimensionen sich diese Modelle
augenscheinlich gleich verhalten [PO2000, PO2001, PO2001a].
<p>Die Philosophie des Domb-Joyce Modells ist sehr verschieden. Im Unterschied
zu ISAW ist die Wechselwirkung rein punktuell. Die Energie der Konfigurationen
h&auml;ngt von der lokalen Dichte ab. Polymerkollaps sollte sich durch
ein erweitertes Domb-Joyce Modell beschreiben lassen, in der die attraktive
Wechselwirkung quadratisch in der Dichte ist und von einem repulsiven Term,
der kubisch von der Dichte abh&auml;ngt, stabilisiert wird [BD1984].
<p>Von der Idee her n&auml;her am ISAW ist eine erweiterte Version des
Brydges-Slade Modells [BS1994], in dem zu einem geeignet normierten lokal
absto&szlig;enden
Term eine eine anziehende N&auml;chste-Nachbar-Wechselwirkung hinzugef&uuml;gt
wird.
<p>Der prinzipielle Unterschied dieser Modelle kann mit einem Vergleich
der entsprechenden kollabierten Globule gesehen werden. F&uuml;r ISAW ist
die Dichte nach oben beschr&auml;nkt, w&auml;hrend es im Domb-Joyce Modell
keine obere Schranke gibt, und im Grenzwert sehr starker Wechselwirkung
die Dichte beliebig gro&szlig; werden kann. Die kollabierte Phase im Brydges-Slade
Modell liegt zwischen diesen beiden Extremen.
<p>In letzter Zeit haben neue Algorithmen und eine drastisch erh&ouml;hte
Leistungsf&auml;higkeit von Computern die M&ouml;glichkeit er&ouml;ffnet,
diese kontroversen Fragen erneut mit Hilfe von Simulationen zu attackieren
[BGZ2000]. Simulationen eines rein repulsiven Domb-Joyce Modells sind durchgef&uuml;hrt
worden[GSS1997], doch bis heute gibt es keine zufriedenstellenden Simulationen
des erweiterten Domb-Joyce Modells f&uuml;r Polymerkollaps oder verwandter
Modelle.
<br>&nbsp;</blockquote>
<b><font size=+1>2.2 <font color="#FF0000">Eigene Vorarbeiten</font></font></b>
<ul>In Erg&auml;nzung zu meinen schon unter Punkt 2.1 zitierten Arbeiten,
m&ouml;chte ich zun&auml;chst darauf hingewiesen, da&szlig; ich in diesem
Jahr eine Habilitationsschrift auf eben diesem Forschungsgebiet (``Lattice
Models of Interacting Polymers and Vesicles'') eingereicht habe.
<p>In diesem Abschnitt soll nun auf konkrete Vor&uuml;berlegungen und Vorarbeiten
eingegangen werden. Diese Vor&uuml;berlegungen sind teilweise spekulativer
Natur, und m&uuml;ssen dementsprechend durch Simulationsergebnisse beziehungsweise
Theorieentwicklung fundiert werden.
<p>Die Simulationen in [PO2000,PO2001] haben die untersch&auml;tzte Bedeutung
der korrekten Modellierung der kollabierten Phase aufgezeigt. In Gittermodellen
wie ISAW und ISAT ist eine nat&uuml;rliche scharfe Begrenzung der Monomerdichte
innerhalb des kollabierten Globules vorhanden. Das Dichteprofil des Globuls
ist wiederum ein essentieller Bestandteil der ph&auml;nomenologischen Meanfield-Theorie
[LGK1978]. Eine Konsequenz ist das Auftreten eines effektiven Oberfl&auml;chenterms
in der freien Energie des Globuls, welche dem beobachteten Scenario einer
``Pseudo-First-Order Transition'' zugrunde liegt. Die Bedeutung dieses
Oberfl&auml;chenterms in Dimension zwei und drei ist von uns schon vor
geraumer Zeit untersucht worden [OPB1993,BOP1993]. Die ph&auml;nomenologische
Ursache des Oberfl&auml;chenterms ist eine weitgehend konstante Dichteverteilung
innerhalb des kollabierten Globuls mit einem sehr scharfen Abfall der Dichte
nach au&szlig;en.
<p>Wenn man nun die Relevanz&nbsp; des Domb-Joyce Modells und &auml;hnlicher
Modelle f&uuml;r Polymerkollaps betrachtet, so f&auml;llt auf, da&szlig;
auf Grund der Punktwechselwirkungen es <i>a priori </i>keine obere Schranke
f&uuml;r die Monomerdichte gibt. Da&szlig; diese obere Schranke relevant
ist, ist schon dadurch ersichtlich, da&szlig; das kollabierte Globul in
einem Domb-Joyce Modell ohne stabilisierende absto&szlig;ende Wechselwirkung
zu einem Punkt unendlich hoher Dichte degeneriert ist. Selbst in einem
erweiterten Domb-Joyce Modell kann man sich vorstellen, da&szlig; sich
die Dichteverteilung im kollabierten Globul anders verh&auml;lt als in
der Meanfield-Analyse [LGK1978]. Wenn sich eine gerundete Dichteverteilung
ohne scharf begrenzten Rand ausbilden w&uuml;rde, so k&ouml;nnte dies eine
Unterdr&uuml;ckung des Oberfl&auml;chenkorrekturterms in der freien Energie
bedeuten, welches das Verhalten sowohl in der kollabierten Phase als auch
am
Kollapsphasen&uuml;bergang empfindlich beeinflussen w&uuml;rde.
<p>Im Fr&uuml;hjahr dieses Jahres habe ich auf einer vorhandenen Implementation
von PERM aufbauend ein Pilotprojekt zur Simulation des Domb-Joyce Modells
begonnen.&nbsp; In vier Raumdimensionen konnte ich im Gegensatz zu ISAW
und ISAT Simulationen keine bimodale Verteilung der Energie feststellen,
welches f&uuml;r das oben diskutierte Scenario sprechen k&ouml;nnte. Die
erreichten Systemgr&ouml;&szlig;en waren allerdings nicht zufriedenstellend,
und f&uuml;r ein genaues Bild m&uuml;ssen gr&ouml;&szlig;ere Systeme simuliert
werden. Ein Problem ist, da&szlig; wegen der andersgearteten Natur des
Domb-Joyce Modells andere Monte Carlo Algorithmen erfolgversprechender
sein k&ouml;nnen, insbesondere wenn dieses Modell in zwei und drei Raumdimensionen
simuliert werden soll.
<p><b><font color="#FF0000"><font size=+1>Eigene relevante Ver&ouml;ffentlichungen</font></font></b>
<p><font color="#000000">(f&uuml;r eine vollst&auml;ndige Auflistung siehe
Curriculum Vitae)</font>
<p>[PO2001a] T. Prellberg and A. L. Owczarek, ``Pseudo-First-Order Transition
in Interacting Self-avoiding Walks and Trails,'' Preprint (2001), submitted
to Comp. Phys. Commun.
<p>[PO2001] T. Prellberg and A. L. Owczarek, ``Four-dimensional polymer
collapse II: Interacting self-avoiding trails,'' Physica A 297 (2001),
275-290.
<p>[OP2001] A. L. Owczarek and T. Prellberg, ``Scaling of Self-Avoiding
Walks in High Dimensions,'' J. Phys. A 34 (2001), 5773-5780
<p>[OP2000]A. L. Owczarek and T. Prellberg, ``First-order scaling near
a second-order phase transition: Tricritical Polymer collapse,'' Europhys.
Lett. 51 (2000), 602-607
<p>[PO2000] T. Prellberg and A. L. Owczarek, ``Four-dimensional polymer
collapse: Pseudo-First-Order Transition in Interacting Self-avoiding Walks,''
Phys. Rev. E 62 (2000) 3780-3789
<p>[OP1998] A. L. Owczarek and T. Prellberg, ``Existence of four-dimensional
polymer collapse I: Kinetic growth Trails,'' Physica A 260 (1998), 20-30
<p>[PD1998] T. Prellberg and B. Drossel, ``Winding angles for two-dimensional
polymers with orientation dependent interactions,'' Phys. Rev. E 57 (1998),
2045-2052
<p>[PO1995] T. Prellberg and A. L. Owczarek, ``Models of Polymer Collapse
in Three Dimensions: Evidence from Kinetic Growth Simulations,'' Phys.
Rev. E. 51 (1995) 2142-2149
<p>[OP1995] A. L. Owczarek and T. Prellberg, ``The Collapse Point of Interacting
Trails in Two Dimensions from Kinetic Growth Simulations,'' J. Stat. Phys.
79 (1995) 951-967
<p>[BOP1993] R. Brak, A. L. Owczarek, and T. Prellberg, ``A Scaling Theory
of the Collapse Transition in Geometric Cluster Models of Polymers and
Vesicles,'' J. Phys. A: Math. Gen. 26 (1993) 4565-4579
<p>[OPB1993] A. L. Owczarek, T. Prellberg, and R. Brak, ``New Scaling Form
for the Collapsed Polymer Phase,'' Phys. Rev. Lett. 70 (1993) 951-953
<p><b><font color="#FF0000"><font size=+1>Literatur</font></font></b>
<p><font color="#000000">[BD1994] A. J. Barrett and C. Domb. J. Stat. Phys.,
77:491, 1994.</font>
<p><font color="#000000">[D1986] B. Duplantier. Europhys. Lett., 1:491,
1986.</font>
<p><font color="#000000">[D1987] B. Duplantier. J. Chem. Phys., 86:4233,
1987.</font>
<p><font color="#000000">[G1975] P. G. de Gennes. J. Physique Lett., 36:L55,
1975.</font>
<p><font color="#000000">[G1978] P. G. de Gennes. J. Physique Lett., 39:L299,
1978.</font>
<p><font color="#000000">[S1975] M. J. Stephen. Phys. Lett. A., 53:363,
1975.</font>
<p>[HS1999] J. Hager and L. Sch&auml;fer. Phys. Rev. E., 60:2071, 1999.
<p><font color="#000000">[V1998] C. Vanderzande. Lattice models of polymers,
1998.</font>
<p><font color="#000000">[DJ1972] C. Domb and G. S. Joyce. J. Phys. C,
5:956, 1972.</font>
<p>[H2001] I. Hueter. Preprint. University of Gainesville.
<p>[H2001a] I. Hueter. Preprint. University of Gainesville.
<p>[SO1984] Y. Shapir and Y. Oono. J. Phys. A., 17:L39, 1984
<p>[CHLS1988] I.S. Chang, A. Guha, H.A. Lim, and Y. Shapir. J. Phys. A.,
21:L559, 1988.
<p><font color="#000000">[BS1994] D. C. Brydges and G. Slade.&nbsp; Probab.
Theory Rel., 103:285, 1995</font>
<p><font color="#000000">[G1996] P. Grassberger and R. Hegger. J. Phys.
A., 29:279,1996.</font>
<p>[BGZ2000] G. Besold, H. Huo, and M.J. Zuckermann. J. Polym. Sci. Pol.
Phys., 38:1053, 2000.
<p>[GSS1997] P. Grassberger, P. Sutter, and L. Sch&auml;fer. J. Phys. A.,
30:7039, 1997.
<p><font color="#000000">[LGK1978] I. M. Lifshitz, A. Y. Grosberg, and
A. R. Khokhlov. Rev. Mod. Phys., 50:683-713, 1978.</font>
<p><font color="#000000">[MS1988] N. Madras and A. D. Sokal J. Stat. Phys.,
50:109, 1988.</font>
<p><font color="#000000">[BS1985] A. Berretti and A. D. Sokal J. Stat.
Phys., 40:483, 1985.</font>
<p>[NB1997] P. Nidras and R. Brak J. Phys. A., 30:1457, 1997
<p><font color="#000000">[G1997] P. Grassberger Phys. Rev. E., 56:3682,
1997</font>
<br>&nbsp;
<br>&nbsp;
<br>
<br>
<center>
<p>&nbsp; <b><font color="#008000"><font size=+2>3 Ziele und Arbeitsprogramm</font></font></b></center>
</ul>
<b><font size=+1>3.1 <font color="#FF0000">Ziele</font></font></b>
<blockquote>Die zu untersuchende Fragestellung ist in wie weit das erweiterte
Domb-Joyce Modell und verwandte Modelle sich in Bezug auf eine Beschreibung
des Polymerkollaps von ISAW/ISAT unterscheiden. Hierf&uuml;r m&uuml;ssen
umfangreiche Monte-Carlo Simulationen implementiert, durchgef&uuml;hrt
und ausgewertet werden.
<p>Unabh&auml;ngig davon, ob sich meine Vermutung, da&szlig; sich der Kollaps
im Domb-Joyce Modell anders als im ISAW Modell verh&auml;lt, bewahrheitet,
wird gehofft, da&szlig; die Simulationsergebnisse wichtige R&uuml;ckschl&uuml;sse
auf die korrekte Modellbildung f&uuml;r Polymere zulassen und Indikationen
f&uuml;r bessere theoretische Analysen geben.
<p>Als Nebenresultat wird eine Weiterentwicklung vorhandener Monte-Carlo
Methoden f&uuml;r Polymersimulation erwartet.</blockquote>
<b><font size=+1>3.2 <font color="#FF0000">Arbeitsprogramm</font></font></b>
<blockquote>Der genaue Projektverlauf ist sehr stark davon abh&auml;ngig,
welche Simulationsmethode gew&auml;hlt werden kann. Sollte sich PERM als
geeignet herausstellen, so kann z.B. die Anfangsphase stark verk&uuml;rzt
werden. Ist auf der anderen Seite ein v&ouml;llig neuer Algorithmus zu
entwerfen und zu untersuchen, so kann die Algorithmenanalyse so etwas wie
ein eigenst&auml;ndiges Projekt werden, in der die Eigenschaften des Algorithmus
untersucht werden m&uuml;ssen.
<p>Da Simulationen im gro&szlig;en Ma&szlig;stab erforderlich sind, werden
hierf&uuml;r speziell angeschaffte Workstations mit insgesamt sechs Prozessoren
eingesetzt. (Als Vergleich ist zu erw&auml;hnen, da&szlig; ich derzeit
auf einem Computer Cluster in J&uuml;lich f&uuml;r ein &auml;hnlich geartetes
Projekt bis zu acht Prozessoren parallel eingesetzt habe, mit Programmlaufzeiten
von bis zu zwei Monaten. Ich habe nur als Gast Zugang zu diesen Resourcen
und kann deshalb darauf kein verl&auml;&szlig;liches langfristiges Forschungsprogramm
basieren.) Wegen des gro&szlig;en Parameterbereiches ist ein hoher Aufwand
an Computerzeit zu erwarten, so da&szlig; selbst mit den beantragten Workstations
die Datensimulation f&uuml;r die jeweiligen Teilprojekte Monate in Anspruch
nehmen wird.
<p>Den Anfang bildet eine Phase, in der neben der Einarbeitung des Mitarbeiters
in den Problemkreis des Polymerkollaps eine Inventur vorhandener Monte-Carlo
Methoden im Hinblick auf ihre Eignung zur Simulation des Domb-Joyce Modells
durchgef&uuml;hrt werden soll (z. B. PERM [G1997], Pivot-Algorithmen [MS1988],
Gro&szlig;kanonische Algorithmen vom Beretti-Sokal-Typ [BS1985], Multiple-Markov-Chain
Methode [NB1997]).&nbsp; Im Zusammenhang mit der Algorithmenauswahl ist
auch ein Besuch der CCP2002 geplant.
<p>Es wird erwartet, da&szlig; nach den ersten sechs Monaten des Projektes
ein lauff&auml;higes Programm mit ersten Simulationsergebnissen vorhanden
ist. Da das Projekt in enger Abstimmung mit einem noch laufenden gemeinschaftlichen
Projekt mit Aleksander Owczarek in Melbourne (Simulationen von ISAW und
ISAT) durchgef&uuml;hrt werden soll, ist in der Anfangsphase ebenfalls
ein Besuch von Aleksander Owczarek in Clausthal vorgesehen.
<p>Sobald die anf&auml;ngliche Programmierung abgeschlossen ist, wird das
Domb-Joyce Modell systematisch untersucht. Zuerst soll das Domb-Joyce Modell
in vier Raumdimensionen untersucht werden. Im Mittelpunkt steht hier die
Frage, ob die bei ISAW und ISAT festgestellte bimodale Verteilung im Domb-Joyce
Modell auffindbar ist. Es ist zu erwarten, da&szlig; die Simulationen und
anschlie&szlig;ende Datenanalyse ein weiteres halbes Jahr in Anspruch nehmen
werden.
<p>Aufbauend auf den vierdimensionalen Simulationen, soll das Domb-Joyce
Modell dann in zwei und drei Raumdimensionen untersucht werden. Es ist
zu erwarten, da&szlig; verbunden hiermit ebenfalls vergleichende Simulationen
von ISAW durchgef&uuml;hrt werden m&uuml;ssen, falls die Ergebnisse einer
sehr subtilen Interpretation bed&uuml;rfen. Die Gr&uuml;nde hierf&uuml;r
liegen zum einen in der notorisch schwierigen Interpretation von Simulationen
in drei Dimensionen und zum anderen darin, da&szlig; Korrekturterme, die
in vier Dimensionen sehr relevant sind, in zwei und drei Dimensionen eine
eher untergeordnete Rolle spielen. Die Ergebnisse sollen auf dem APS March
Meeting einer breiten &Ouml;ffentlichkeit zug&auml;nglich gemacht werden.
Zwecks wissenschaftlichen Austausches ist ein Besuch des wissenschaftlichen
Mitarbeiters bei der Gruppe in Melbourne ins Auge gefa&szlig;t.
<p>Danach sollen die Untersuchungen auf verwandte Modelle (erweitertes
Brydges-Slade Modell) ausgedehnt werden. Die genaue Projektierung h&auml;ngt
nat&uuml;rlich von den bisherigen Ergebnissen ab. Die Forschungsergebnisse
sollen zusammenfassend auf der StatPhys22 berichtet werden.
<br>&nbsp;
<br>&nbsp;
<br>
<center>
<p><b><font color="#008000"><font size=+2>4 Beantragte Mittel</font></font></b></center>
</blockquote>
<b><font size=+1>4.1 <font color="#FF0000">Personalkosten</font></font></b>
<ul>Ein wissenschaftlicher Mitarbeiter nach BAT IIa f&uuml;r drei Jahre
<p>Eine studentische Hilfskraft im Umfang von 40 Std/Monat f&uuml;r drei
Jahre f&uuml;r Implementierungs- und Wartungsarbeiten</ul>
<b><font size=+1>4.2 <font color="#FF0000">Wissenschaftliche Ger&auml;te</font></font></b>
<blockquote>b) Drei Dualprozessor-Workstations mit Linux Operating System
f&uuml;r Simulationen, eine davon zus&auml;tzlich als Arbeitsplatzrecher
f&uuml;r Datenauswertung konzipiert, f&uuml;r genaue Spezifikation siehe
beigelegtes Angebot (Reine Simulations-Workstations: je 5423.02 DM, Simulations-
und Arbeitsplatzrechner: 6789.00 DM, Ethernet Hub 214.18 DM)
<p>Ger&auml;te Gesamtkosten: DM 18000</blockquote>
<b><font size=+1>4.4 <font color="#FF0000">Reisen</font></font></b>
<ul>
<li>
2002: DM 10000, aufgeschl&uuml;sselt wie folgt:</li>

<br>&nbsp;
<p>&nbsp;
<br>&nbsp;
<br>&nbsp;
<p>Vierw&ouml;chiger Arbeitsbesuch von A. L. Owczarek in Clausthal:
<br>Reisekosten (Melbourne): DM 3000
<br>Hotelkosten/Tagegeld: DM 3000
<br>gesamt: 6000 DM
<p>Teilnahme an der CCP 2002 in San Diego, California, USA (August 25 -
28)
<br>Reisekosten: DM 2000
<br>Hotelkosten/Tagegeld: DM 1500
<br>Konferenzgeb&uuml;hren: DM 500
<br>gesamt: DM 4000
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<li>
2003: DM 11600, aufgeschl&uuml;sselt wie folgt:</li>

<br>&nbsp;
<p>&nbsp;
<br>&nbsp;
<br>&nbsp;
<p>APS Marchmeeting in Austin, Texas, USA (March 3-7)
<br>Reisekosten: DM 2000
<br>Hotelkosten/Tagegeld: DM 1500
<br>Konferenzgeb&uuml;hren: DM 500
<br>gesamt: DM 4000
<p>Vierw&ouml;chiger Arbeitsbesuch des wissenschaftlichen Mitarbeiters
in Melbourne:
<br>Reisekosten (Melbourne): DM 3000
<br>Hotelkosten/Tagegeld: DM 5600
<br>gesamt: 8600 DM
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<li>
2004: DM 15100, aufgeschl&uuml;sselt wie folgt:</li>

<br>&nbsp;
<p>&nbsp;
<br>&nbsp;
<br>&nbsp;
<p>DPG Fr&uuml;hjahrstreffen: DM 1500
<p>Vierw&ouml;chiger Arbeitsbesuch von Dr. Prellberg in Melbourne:
<br>Reisekosten (Melbourne): DM 3000
<br>Hotelkosten/Tagegeld: DM 5600
<br>gesamt: DM 8600
<p>StatPhys 22 und angemessene Satellitenkonferenz:
<br>Reisekosten: DM 2500
<br>Hotelkosten/Tagegeld: DM 2000
<br>Konferenzgeb&uuml;hren: DM 500
<br>gesamt:&nbsp; DM 5000
<br>&nbsp;</ul>

<center><b><font color="#008000"><font size=+2>5 Voraussetzungen f&uuml;r
die Durchf&uuml;hrung des Vorhabens</font></font></b></center>

<p><b><font size=+1>5.1 <font color="#FF0000">Zusammensetzung der Arbeitsgruppe</font></font></b>
<ul>Dr. Thomas Prellberg, Wissenschaftlicher Assistent</ul>
<b><font size=+1>5.2 <font color="#FF0000">Zusammenarbeit mit anderen Wissenschaftlern</font></font></b>
<blockquote>Dr. Aleksander L. Owczarek, University of Melbourne, Australien
<p>Prof. Peter Grassberger, NIC, Forschungszentrum J&uuml;lich</blockquote>
<b><font size=+1>5.3 <font color="#FF0000">Arbeiten im Ausland und Kooperation
mit ausl&auml;ndischen Wissenschaftlern</font></font></b>
<blockquote>Es ist geplant, mit Dr. Owczarek eng zusammenzuarbeiten</blockquote>
<b><font size=+1>5.4 <font color="#FF0000">Apparative Ausstattung</font></font></b>
<blockquote>In Clausthal: Zwei Dual-Prozessor Penium-III, 550 MHz</blockquote>
<b><font size=+1>5.5 <font color="#FF0000">Laufende Mittel f&uuml;r Sachausgaben</font></font></b>
<blockquote>Ein Zuschu&szlig; aus Sachmitteln von ungef&auml;hr DM 1000
/ Jahr ist m&ouml;glich</blockquote>
<b><font size=+1>5.6 <font color="#FF0000">Sonstige Voraussetzungen</font></font></b>
<blockquote>In Kooperation mit Prof. Grassberger besteht derzeit der Zugang
zu einem DEC Alpha Cluster am Forschungszentrum J&uuml;lich.</blockquote>

<center>
<p><br><b><font color="#008000"><font size=+2>7 Erkl&auml;rungen</font></font></b></center>

<blockquote>Ein Antrag auf Finanzierung dieses Vorhabens wurde bei keiner
anderen Stelle eingereicht. Wenn ich einen solchen Antrag stelle, werde
ich die Deutsche Forschungsgemeinschaft unverz&uuml;glich benachrichtigen.
<p>Der Vertrauensdozent der DFG an der TU Clausthal, Prof. J. Fuhrmann,
wird von diesem Antrag unterrichtet.</blockquote>

<center>
<p><br><b><font color="#008000"><font size=+2>8 Unterschriften</font></font></b></center>

<blockquote>(Thomas Prellberg)</blockquote>

<center>
<p><br><b><font color="#008000"><font size=+2>9 Verzeichnis der Anlagen</font></font></b></center>

<blockquote>Curriculum Vitae von Thomas Prellberg
<p>Kostenvoranschlag f&uuml;r Workstations
<p>Reprints
<br>&nbsp;</blockquote>
<font size=+1>weiter zur <a href="antragsergaenzung.html">Antragserg&auml;nzung</a></font>
</body>
</html>
